CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
    gpio_pin_config_t KEY_BTUP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 109)  */
    GPIO_PinInit(GPIO_KEY_BTUP_GPIO, GPIO_KEY_BTUP_PIN, &KEY_BTUP_config);

    gpio_pin_config_t KEY_BTRT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 110)  */
    GPIO_PinInit(GPIO_KEY_BTRT_GPIO, GPIO_KEY_BTRT_PIN, &KEY_BTRT_config);

    gpio_pin_config_t KEY_BTDN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 111)  */
    GPIO_PinInit(GPIO_KEY_BTDN_GPIO, GPIO_KEY_BTDN_PIN, &KEY_BTDN_config);

    gpio_pin_config_t KEY_BTLF_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 112)  */
    GPIO_PinInit(GPIO_KEY_BTLF_GPIO, GPIO_KEY_BTLF_PIN, &KEY_BTLF_config);

    gpio_pin_config_t KEY_BTOK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 113)  */
    GPIO_PinInit(GPIO_KEY_BTOK_GPIO, GPIO_KEY_BTOK_PIN, &KEY_BTOK_config);

    gpio_pin_config_t KEY_SW01_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 117)  */
    GPIO_PinInit(GPIO_KEY_SW01_GPIO, GPIO_KEY_SW01_PIN, &KEY_SW01_config);

    gpio_pin_config_t KEY_SW02_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC13 (pin 118)  */
    GPIO_PinInit(GPIO_KEY_SW02_GPIO, GPIO_KEY_SW02_PIN, &KEY_SW02_config);

    gpio_pin_config_t KEY_SW03_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 119)  */
    GPIO_PinInit(GPIO_KEY_SW03_GPIO, GPIO_KEY_SW03_PIN, &KEY_SW03_config);

    gpio_pin_config_t KEY_SW04_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 120)  */
    GPIO_PinInit(GPIO_KEY_SW04_GPIO, GPIO_KEY_SW04_PIN, &KEY_SW04_config);

    gpio_pin_config_t RSV_D1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 128)  */
    GPIO_PinInit(GPIO_RSV_D1_GPIO, GPIO_RSV_D1_PIN, &RSV_D1_config);

    gpio_pin_config_t RSV_D2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 129)  */
    GPIO_PinInit(GPIO_RSV_D2_GPIO, GPIO_RSV_D2_PIN, &RSV_D2_config);

    gpio_pin_config_t CAM_PCLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 131)  */
    GPIO_PinInit(GPIO_CAM_PCLK_GPIO, GPIO_CAM_PCLK_PIN, &CAM_PCLK_config);

    gpio_pin_config_t CAM_VSNC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 132)  */
    GPIO_PinInit(GPIO_CAM_VSNC_GPIO, GPIO_CAM_VSNC_PIN, &CAM_VSNC_config);

    gpio_pin_config_t RSV_D6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 133)  */
    GPIO_PinInit(GPIO_RSV_D6_GPIO, GPIO_RSV_D6_PIN, &RSV_D6_config);

    gpio_pin_config_t RSV_D7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 136)  */
    GPIO_PinInit(GPIO_RSV_D7_GPIO, GPIO_RSV_D7_PIN, &RSV_D7_config);

    gpio_pin_config_t CAM_D0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 137)  */
    GPIO_PinInit(GPIO_CAM_D0_GPIO, GPIO_CAM_D0_PIN, &CAM_D0_config);

    gpio_pin_config_t CAM_D1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 138)  */
    GPIO_PinInit(GPIO_CAM_D1_GPIO, GPIO_CAM_D1_PIN, &CAM_D1_config);

    gpio_pin_config_t CAM_D2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 139)  */
    GPIO_PinInit(GPIO_CAM_D2_GPIO, GPIO_CAM_D2_PIN, &CAM_D2_config);

    gpio_pin_config_t CAM_D3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 140)  */
    GPIO_PinInit(GPIO_CAM_D3_GPIO, GPIO_CAM_D3_PIN, &CAM_D3_config);

    gpio_pin_config_t CAM_D4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 141)  */
    GPIO_PinInit(GPIO_CAM_D4_GPIO, GPIO_CAM_D4_PIN, &CAM_D4_config);

    gpio_pin_config_t CAM_D5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 142)  */
    GPIO_PinInit(GPIO_CAM_D5_GPIO, GPIO_CAM_D5_PIN, &CAM_D5_config);

    gpio_pin_config_t CAM_D6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 143)  */
    GPIO_PinInit(GPIO_CAM_D6_GPIO, GPIO_CAM_D6_PIN, &CAM_D6_config);

    gpio_pin_config_t CAM_D7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 144)  */
    GPIO_PinInit(GPIO_CAM_D7_GPIO, GPIO_CAM_D7_PIN, &CAM_D7_config);

    gpio_pin_config_t SD_DTK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE8 (pin 11)  */
    GPIO_PinInit(GPIO_SD_DTK_GPIO, GPIO_SD_DTK_PIN, &SD_DTK_config);

