CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
    gpio_pin_config_t TOF0_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE26 (pin 47)  */
    GPIO_PinInit(GPIO_TOF0_INT_GPIO, GPIO_TOF0_INT_PIN, &TOF0_INT_config);

    gpio_pin_config_t TOF0_XHT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE27 (pin 48)  */
    GPIO_PinInit(GPIO_TOF0_XHT_GPIO, GPIO_TOF0_XHT_PIN, &TOF0_XHT_config);

    gpio_pin_config_t TOF1_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE28 (pin 49)  */
    GPIO_PinInit(GPIO_TOF1_INT_GPIO, GPIO_TOF1_INT_PIN, &TOF1_INT_config);

    /* PORTA10 (pin 62) is configured as PTA10 */
    PORT_SetPinMux(GPIO_OLED_RST_PORT, GPIO_OLED_RST_PIN, kPORT_MuxAsGpio);

    /* PORTA11 (pin 63) is configured as PTA11 */
    PORT_SetPinMux(GPIO_OLED_D_C_PORT, GPIO_OLED_D_C_PIN, kPORT_MuxAsGpio);

    /* PORTA4 (pin 54) is configured as PTA4 */
    PORT_SetPinMux(GPIO_TOF1_XHT_PORT, GPIO_TOF1_XHT_PIN, kPORT_MuxAsGpio);

    /* PORTC12 (pin 117) is configured as PTC12 */
    PORT_SetPinMux(GPIO_KEY_SW01_PORT, GPIO_KEY_SW01_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[12] = ((PORTC->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC13 (pin 118) is configured as PTC13 */
    PORT_SetPinMux(GPIO_KEY_SW02_PORT, GPIO_KEY_SW02_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[13] = ((PORTC->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC14 (pin 119) is configured as PTC14 */
    PORT_SetPinMux(GPIO_KEY_SW03_PORT, GPIO_KEY_SW03_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[14] = ((PORTC->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC15 (pin 120) is configured as PTC15 */
    PORT_SetPinMux(GPIO_KEY_SW04_PORT, GPIO_KEY_SW04_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[15] = ((PORTC->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC4 (pin 109) is configured as PTC4 */
    PORT_SetPinMux(GPIO_KEY_BTUP_PORT, GPIO_KEY_BTUP_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[4] = ((PORTC->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC5 (pin 110) is configured as PTC5 */
    PORT_SetPinMux(GPIO_KEY_BTRT_PORT, GPIO_KEY_BTRT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[5] = ((PORTC->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(GPIO_KEY_BTDN_PORT, GPIO_KEY_BTDN_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[6] = ((PORTC->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC7 (pin 112) is configured as PTC7 */
    PORT_SetPinMux(GPIO_KEY_BTLF_PORT, GPIO_KEY_BTLF_PIN, kPORT_MuxAsGpio);

