CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
    PORTC->PCR[7] = ((PORTC->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(GPIO_KEY_BTOK_PORT, GPIO_KEY_BTOK_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[8] = ((PORTC->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port D */
        PORTD,
        /* Digital filter is configured for PORTD0 */
          PORT_DFER_DFE_1_MASK
            /* Digital filter is configured for PORTD1 */
            | PORT_DFER_DFE_2_MASK,
        /* Enable digital filter */
        true);

    /* PORTD1 (pin 128) is configured as PTD1 */
    PORT_SetPinMux(GPIO_RSV_D1_PORT, GPIO_RSV_D1_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD10 (pin 139) is configured as PTD10 */
    PORT_SetPinMux(GPIO_CAM_D2_PORT, GPIO_CAM_D2_PIN, kPORT_MuxAsGpio);

    /* PORTD11 (pin 140) is configured as PTD11 */
    PORT_SetPinMux(GPIO_CAM_D3_PORT, GPIO_CAM_D3_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 141) is configured as PTD12 */
    PORT_SetPinMux(GPIO_CAM_D4_PORT, GPIO_CAM_D4_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin 142) is configured as PTD13 */
    PORT_SetPinMux(GPIO_CAM_D5_PORT, GPIO_CAM_D5_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin 143) is configured as PTD14 */
    PORT_SetPinMux(GPIO_CAM_D6_PORT, GPIO_CAM_D6_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 144) is configured as PTD15 */
    PORT_SetPinMux(GPIO_CAM_D7_PORT, GPIO_CAM_D7_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 129) is configured as PTD2 */
    PORT_SetPinMux(GPIO_RSV_D2_PORT, GPIO_RSV_D2_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[2] = ((PORTD->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD4 (pin 131) is configured as PTD4 */
    PORT_SetPinMux(GPIO_CAM_PCLK_PORT, GPIO_CAM_PCLK_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 132) is configured as PTD5 */
    PORT_SetPinMux(GPIO_CAM_VSNC_PORT, GPIO_CAM_VSNC_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 133) is configured as PTD6 */
    PORT_SetPinMux(GPIO_RSV_D6_PORT, GPIO_RSV_D6_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 136) is configured as PTD7 */
    PORT_SetPinMux(GPIO_RSV_D7_PORT, GPIO_RSV_D7_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as PTD8 */
    PORT_SetPinMux(GPIO_CAM_D0_PORT, GPIO_CAM_D0_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 138) is configured as PTD9 */
    PORT_SetPinMux(GPIO_CAM_D1_PORT, GPIO_CAM_D1_PIN, kPORT_MuxAsGpio);

    /* PORTE26 (pin 47) is configured as PTE26 */
    PORT_SetPinMux(GPIO_TOF0_INT_PORT, GPIO_TOF0_INT_PIN, kPORT_MuxAsGpio);

    /* PORTE27 (pin 48) is configured as PTE27 */
    PORT_SetPinMux(GPIO_TOF0_XHT_PORT, GPIO_TOF0_XHT_PIN, kPORT_MuxAsGpio);

    /* PORTE28 (pin 49) is configured as PTE28 */
    PORT_SetPinMux(GPIO_TOF1_INT_PORT, GPIO_TOF1_INT_PIN, kPORT_MuxAsGpio);

    /* PORTE8 (pin 11) is configured as PTE8 */
    PORT_SetPinMux(GPIO_SD_DTK_PORT, GPIO_SD_DTK_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
i2c:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '64', peripheral: I2C2, signal: SCL, pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/RMII0_RXD1/MII0_RXD1/I2C2_SCL/I2S0_TXD0/FTM1_QD_PHA/TPM1_CH0, open_drain: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: '65', peripheral: I2C2, signal: SDA, pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/RMII0_RXD0/MII0_RXD0/I2C2_SDA/I2S0_TX_FS/FTM1_QD_PHB/TPM1_CH1,
    open_drain: enable, pull_select: up, pull_enable: enable}
  - {pin_num: '45', peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE17/PTE24/CAN1_TX/UART4_TX/I2C0_SCL/EWM_OUT_b, open_drain: enable, pull_select: up, pull_enable: enable}
  - {pin_num: '46', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE18/PTE25/LLWU_P21/CAN1_RX/UART4_RX/I2C0_SDA/EWM_IN, open_drain: enable, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : i2c
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void i2c(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA12 (pin 64) is configured as I2C2_SCL */
    PORT_SetPinMux(I2C_IMU_SCL_PORT, I2C_IMU_SCL_PIN, kPORT_MuxAlt5);

