CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : ftm
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void ftm(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA5 (pin 55) is configured as FTM0_CH2 */
    PORT_SetPinMux(FTM_MOTOR_RA_PORT, FTM_MOTOR_RA_PIN, kPORT_MuxAlt3);

    /* PORTA6 (pin 58) is configured as FTM0_CH3 */
    PORT_SetPinMux(FTM_MOTOR_RB_PORT, FTM_MOTOR_RB_PIN, kPORT_MuxAlt3);

    /* PORTA8 (pin 60) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(FTM_ENCO_LA_PORT, FTM_ENCO_LA_PIN, kPORT_MuxAlt6);

    /* PORTA9 (pin 61) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(FTM_ENCO_LB_PORT, FTM_ENCO_LB_PIN, kPORT_MuxAlt6);

    /* PORTB18 (pin 97) is configured as FTM2_QD_PHA */
    PORT_SetPinMux(FTM_ENCO_RA_PORT, FTM_ENCO_RA_PIN, kPORT_MuxAlt6);

    /* PORTB19 (pin 98) is configured as FTM2_QD_PHB */
    PORT_SetPinMux(FTM_ENCO_RB_PORT, FTM_ENCO_RB_PIN, kPORT_MuxAlt6);

    /* PORTC1 (pin 104) is configured as FTM0_CH0 */
    PORT_SetPinMux(FTM_MOTOR_LA_PORT, FTM_MOTOR_LA_PIN, kPORT_MuxAlt4);

    /* PORTC10 (pin 115) is configured as FTM3_CH6 */
    PORT_SetPinMux(FTM_CLEDR_G_PORT, FTM_CLEDR_G_PIN, kPORT_MuxAlt3);

    /* PORTC11 (pin 116) is configured as FTM3_CH7 */
    PORT_SetPinMux(FTM_CLEDR_R_PORT, FTM_CLEDR_R_PIN, kPORT_MuxAlt3);

    /* PORTC2 (pin 105) is configured as FTM0_CH1 */
    PORT_SetPinMux(FTM_MOTOR_LB_PORT, FTM_MOTOR_LB_PIN, kPORT_MuxAlt4);

    /* PORTC9 (pin 114) is configured as FTM3_CH5 */
    PORT_SetPinMux(FTM_CLEDR_B_PORT, FTM_CLEDR_B_PIN, kPORT_MuxAlt3);

    /* PORTD0 (pin 127) is configured as FTM3_CH0 */
    PORT_SetPinMux(FTM_SERVO_F_PORT, FTM_SERVO_F_PIN, kPORT_MuxAlt4);

    /* PORTD3 (pin 130) is configured as FTM3_CH3 */
    PORT_SetPinMux(FTM_SERVO_B_PORT, FTM_SERVO_B_PIN, kPORT_MuxAlt4);

    /* PORTE6 (pin 9) is configured as FTM3_CH1 */
    PORT_SetPinMux(FTM_CLEDL_B_PORT, FTM_CLEDL_B_PIN, kPORT_MuxAlt6);

    /* PORTE7 (pin 10) is configured as FTM3_CH2 */
    PORT_SetPinMux(FTM_CLEDL_G_PORT, FTM_CLEDL_G_PIN, kPORT_MuxAlt6);

    /* PORTE9 (pin 12) is configured as FTM3_CH4 */
    PORT_SetPinMux(FTM_CLEDL_R_PORT, FTM_CLEDL_R_PIN, kPORT_MuxAlt6);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
adc:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '103', peripheral: ADC0, signal: 'SE, 14', pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/PDB0_EXTRG/USB0_SOF_OUT/FB_AD14/SDRAM_A22/I2S0_TXD1}
  - {pin_num: '59', peripheral: ADC0, signal: 'SE, 10', pin_signal: ADC0_SE10/PTA7/FTM0_CH4/RMII0_MDIO/MII0_MDIO/TRACE_D3}
  - {pin_num: '38', peripheral: ADC0, signal: 'SE, 23', pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23}
  - {pin_num: '39', peripheral: ADC1, signal: 'SE, 23', pin_signal: DAC1_OUT/CMP0_IN4/CMP2_IN3/ADC1_SE23}
  - {pin_num: '83', peripheral: ADC0, signal: 'SE, 12', pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/UART0_RTS_b/ENET0_1588_TMR0/SDRAM_WE/FTM0_FLT3}
  - {pin_num: '84', peripheral: ADC0, signal: 'SE, 13', pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/ENET0_1588_TMR1/SDRAM_CS0_b/FTM0_FLT0}
  - {pin_num: '81', peripheral: ADC0, signal: 'SE, 8', pin_signal: ADC0_SE8/ADC1_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/RMII0_MDIO/MII0_MDIO/SDRAM_CAS_b/FTM1_QD_PHA/TPM1_CH0}
  - {pin_num: '82', peripheral: ADC0, signal: 'SE, 9', pin_signal: ADC0_SE9/ADC1_SE9/TSI0_CH6/PTB1/I2C0_SDA/FTM1_CH1/RMII0_MDC/MII0_MDC/SDRAM_RAS_b/FTM1_QD_PHB/TPM1_CH1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : adc
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void adc(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTA7 (pin 59) is configured as ADC0_SE10 */
    PORT_SetPinMux(ADC_MOTOR_IR_PORT, ADC_MOTOR_IR_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB0 (pin 81) is configured as ADC0_SE8 */
    PORT_SetPinMux(ADC_MAG_XL_PORT, ADC_MAG_XL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB1 (pin 82) is configured as ADC0_SE9 */
    PORT_SetPinMux(ADC_MAG_XR_PORT, ADC_MAG_XR_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB2 (pin 83) is configured as ADC0_SE12 */
    PORT_SetPinMux(ADC_MAG_YL_PORT, ADC_MAG_YL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin 84) is configured as ADC0_SE13 */
    PORT_SetPinMux(ADC_MAG_YR_PORT, ADC_MAG_YR_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC0 (pin 103) is configured as ADC0_SE14 */
    PORT_SetPinMux(ADC_MOTOR_IL_PORT, ADC_MOTOR_IL_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
sdhc:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '2', peripheral: SDHC, signal: 'DATA, 0', pin_signal: ADC1_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/SDHC0_D0/TRACE_D3/I2C1_SCL/SPI1_SIN}
  - {pin_num: '1', peripheral: SDHC, signal: 'DATA, 1', pin_signal: ADC1_SE4a/PTE0/SPI1_PCS1/UART1_TX/SDHC0_D1/TRACE_CLKOUT/I2C1_SDA/RTC_CLKOUT}
  - {pin_num: '8', peripheral: SDHC, signal: 'DATA, 2', pin_signal: PTE5/SPI1_PCS2/UART3_RX/SDHC0_D2/FTM3_CH0}
  - {pin_num: '7', peripheral: SDHC, signal: 'DATA, 3', pin_signal: PTE4/LLWU_P2/SPI1_PCS0/UART3_TX/SDHC0_D3/TRACE_D0}
  - {pin_num: '4', peripheral: SDHC, signal: CMD, pin_signal: ADC1_SE7a/PTE3/SPI1_SIN/UART1_RTS_b/SDHC0_CMD/TRACE_D1/SPI1_SOUT}
  - {pin_num: '3', peripheral: SDHC, signal: DCLK, pin_signal: ADC1_SE6a/PTE2/LLWU_P1/SPI1_SCK/UART1_CTS_b/SDHC0_DCLK/TRACE_D2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

